src/Catalogs/Скрипты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Скрипты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ГлобальныйМодульСервер/Ext/Module.bsl
Функция КаталогВнешнихДанных() Экспорт

	Возврат Константы.КаталогВнешнихДанных.Получить();

КонецФункции

// Подготавливает стандартный ответ для функции
//Параметры
//	КодВозврата - Число - 0 - ОК, 1 - есть предупреждения, возможно продолжение выполнения, 2 - есть ошибки, продолжение выполнения невозможно
//	ОписаниеОшибки - Строка - Объяснение сусти проблемы, когда КодВозврата <> 0
//	Лог - Строка - Лог выполнения операции, например стандартный вывод, полученный  при выполнении метода УдаленноеУправление.ВыполнитьКомандуCMD
Функция Результат(КодВозврата, ОписаниеОшибки = "", Лог = "") Экспорт

	Возврат Новый Структура("КодВозврата, ОписаниеОшибки, Лог", КодВозврата, ОписаниеОшибки, Лог);

КонецФункции // ()

// ИнтеграцияВЕТИС.Ожидать
Процедура Пауза(ВремяОжидания) Экспорт
	
	Если ВремяОжидания <> 0 Тогда
		
		НастройкиПрокси = Новый ИнтернетПрокси(Ложь);
		НастройкиПрокси.НеИспользоватьПроксиДляЛокальныхАдресов = Истина;
		НастройкиПрокси.НеИспользоватьПроксиДляАдресов.Добавить("127.0.0.0");
		
		Попытка
			Loopback = Новый HTTPСоединение(
				"127.0.0.0",,,,НастройкиПрокси,
				ВремяОжидания);
			Loopback.Получить(Новый HTTPЗапрос());
		Исключение
			ВремяОжидания = 0;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСкрипт(Идентификатор) Экспорт

	Возврат Справочники.Скрипты.НайтиПоРеквизиту("Идентификатор", Идентификатор).Текст;

КонецФункции
